{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 100, "W_constraint": null, "name": "embedding_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.0, "input_dim": 167, "output_dim": 50}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "forget_bias_init": "one", "output_dim": 64}}, "trainable": true, "name": "bidirectional_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 32}}], "inbound_nodes": [[["input_3", 0, 0]], [["input_4", 0, 0]]], "name": "sequential_2"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0080\u0000\u0000sE\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000|\u0002\u0000\u0018\u0083\u0001\u0000t\u0000\u0000j\u0004\u0000\u0083\u0000\u0000\u0017d\u0001\u0000d\u0002\u0000d\u0003\u0000t\u0005\u0000\u0083\u0001\u0002\u0083\u0001\u0000S(\u0004\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000t\b\u0000\u0000\u0000keepdims(\u0006\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0004\u0000\u0000\u0000sqrtt\u0003\u0000\u0000\u0000sumt\u0006\u0000\u0000\u0000squaret\u0007\u0000\u0000\u0000epsilont\u0004\u0000\u0000\u0000True(\u0003\u0000\u0000\u0000t\u0005\u0000\u0000\u0000vectst\u0001\u0000\u0000\u0000xt\u0001\u0000\u0000\u0000y(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000run.pyt\u0012\u0000\u0000\u0000euclidean_distance7\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0080\u0000\u0000s\u001a\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000d\u0001\u0000\u0019d\u0002\u0000f\u0002\u0000S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0006\u0000\u0000\u0000shapest\u0006\u0000\u0000\u0000shape1t\u0006\u0000\u0000\u0000shape2(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000run.pyt\u0016\u0000\u0000\u0000eucl_dist_output_shape;\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["sequential_2", 1, 0], ["sequential_2", 2, 0]]], "name": "lambda_2"}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["lambda_2", 0, 0]], "name": "model_2"}}